---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.Origin
zh: 原点
source: html/bf9d9963-52de-d53b-488c-8a57bec94662.htm
---
# Autodesk.Revit.DB.ConnectorElement.Origin Property

**中文**: 原点

The location of the connector in family document.

## Syntax (C#)
```csharp
public virtual XYZ Origin { get; }
```